avr-rust/avrd/packs/tiny/ATtiny840.atdf
        <module name="CPU">
          <instance name="CPU" caption="CPU Registers">
            <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data" caption="CPU Registers"/>
          </instance>
        </module>
        <module name="DEVICEID">
          <instance name="DEVICEID" caption="Device ID">
            <register-group name="DEVICEID" name-in-module="DEVICEID" offset="0x0" address-space="data" caption="Device ID"/>
          </instance>
        </module>
        <module name="FUSE">
          <instance name="FUSE" caption="Fuses">
            <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses" caption="Fuses"/>
          </instance>
        </module>
        <module name="LOCKBIT">
          <instance name="LOCKBIT" caption="Lockbits">
            <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits" caption="Lockbits"/>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt index="0" name="RESET" caption="External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset"/>
        <interrupt index="1" name="INT0" caption="External Interrupt Request 0"/>
        <interrupt index="3" name="PCINT0" caption="Pin Change Interrupt Request 0"/>
        <interrupt index="4" name="PCINT1" caption="Pin Change Interrupt Request 0"/>
        <interrupt index="5" name="PCINT2" caption="Pin Change Interrupt Request 1"/>
        <interrupt index="6" name="WDT" caption="Watchdog Time-out Interrupt"/>
        <interrupt index="7" name="TIMER2_COMPA" caption="Timer/Counter2 Compare Match A"/>
        <interrupt index="8" name="TIMER2_COMPB" caption="Timer/Counter2 Compare Match A"/>
        <interrupt index="9" name="TIMER2_OVF" caption="Timer/Counter2 Overflow"/>
        <interrupt index="10" name="TIMER1_CAPT" caption="Timer/Counter1 Capture Event"/>
        <interrupt index="11" name="TIMER1_COMPA" caption="Timer/Counter1 Compare Match A"/>
        <interrupt index="12" name="TIMER1_COMPB" caption="Timer/Counter1 Compare Match B"/>
        <interrupt index="13" name="TIMER1_OVF" caption="Timer/Counter1 Overflow"/>
        <interrupt index="14" name="TIMER0_COMPA" caption="TimerCounter0 Compare Match A"/>
        <interrupt index="15" name="TIMER0_COMPB" caption="TimerCounter0 Compare Match B"/>
        <interrupt index="16" name="TIMER0_OVF" caption="Timer/Couner0 Overflow"/>
        <interrupt index="17" name="SPI_STC" caption="SPI Serial Transfer Complete"/>
        <interrupt index="21" name="CLI" caption="Custom Logic Interrupt"/>
        <interrupt index="22" name="EE_READY" caption="EEPROM Ready"/>
        <interrupt index="23" name="ANALOG_COMP" caption="Analog Comparator"/>
        <interrupt index="25" name="SPM_Ready" caption="Store Program Memory Read"/>
        <interrupt index="28" name="USART_RX" caption="USART Rx Complete"/>
        <interrupt index="29" name="USART_UDRE" caption="USART, Data Register Empty"/>
        <interrupt index="30" name="USART_TX" caption="USART Tx Complete"/>
        <interrupt index="31" name="USART_START" caption="USART Start Edge Interrupt"/>
        <interrupt index="32" name="TIMER3_CAPT" caption="Timer/Counter3 Capture Event"/>
        <interrupt index="33" name="TIMER3_COMPA" caption="Timer/Counter3 Compare Match A"/>
        <interrupt index="34" name="TIMER3_COMPB" caption="Timer/Counter3 Compare Match B"/>
        <interrupt index="35" name="TIMER3_OVF" caption="Timer/Counter3 Overflow"/>
        <interrupt index="37" name="PTC_EOC" caption="PTC End of conversion"/>
        <interrupt index="38" name="PTC_WCOMP" caption="PTC Window comparator mode"/>
      </interrupts>
      <interfaces>
        <interface name="ISP" type="isp"/>
        <interface name="HVSP" type="hvsp"/>
        <interface name="debugWIRE" type="dw"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x93C3"/>
          <property name="SIGNATURE0" value="0x1e"/>
          <property name="SIGNATURE1" value="0x93"/>
          <property name="SIGNATURE2" value="0xC3"/>
        </property-group>
        <property-group name="OCD">
          <property name="OCD_REVISION" value="1"/>
          <property name="OCD_DATAREG" value="0x31"/>
          <property name="PROGBASE" value="0x0000"/>
        </property-group>
        <property-group name="ISP_INTERFACE">
          <property name="IspEnterProgMode_timeout" value="200"/>
          <property name="IspEnterProgMode_stabDelay" value="100"/>
          <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
          <property name="IspEnterProgMode_synchLoops" value="32"/>
          <property name="IspEnterProgMode_byteDelay" value="0"/>
          <property name="IspEnterProgMode_pollIndex" value="3"/>
          <property name="IspEnterProgMode_pollValue" value="0x53"/>
          <property name="IspLeaveProgMode_preDelay" value="1"/>
          <property name="IspLeaveProgMode_postDelay" value="1"/>
          <property name="IspChipErase_eraseDelay" value="45"/>
          <property name="IspChipErase_pollMethod" value="1"/>
          <property name="IspProgramFlash_mode" value="0x41"/>
          <property name="IspProgramFlash_blockSize" value="64"/>
          <property name="IspProgramFlash_delay" value="10"/>
          <property name="IspProgramFlash_cmd1" value="0x40"/>
          <property name="IspProgramFlash_cmd2" value="0x4C"/>
          <property name="IspProgramFlash_cmd3" value="0x00"/>
          <property name="IspProgramFlash_pollVal1" value="0x00"/>
          <property name="IspProgramFlash_pollVal2" value="0x00"/>
          <property name="IspProgramEeprom_mode" value="0x41"/>
          <property name="IspProgramEeprom_blockSize" value="4"/>
          <property name="IspProgramEeprom_delay" value="20"/>
          <property name="IspProgramEeprom_cmd1" value="0xC1"/>
          <property name="IspProgramEeprom_cmd2" value="0xC2"/>
          <property name="IspProgramEeprom_cmd3" value="0x00"/>
          <property name="IspProgramEeprom_pollVal1" value="0x00"/>
          <property name="IspProgramEeprom_pollVal2" value="0x00"/>
          <property name="IspReadFlash_blockSize" value="64"/>
          <property name="IspReadEeprom_blockSize" value="4"/>
          <property name="IspReadFuse_pollIndex" value="4"/>
          <property name="IspReadLock_pollIndex" value="4"/>
          <property name="IspReadSign_pollIndex" value="4"/>
          <property name="IspReadOsccal_pollIndex" value="4"/>
        </property-group>
        <property-group name="HVSP_INTERFACE">
          <property name="HvspControlStack" value="0x4C 0x0C 0x1C 0x2C 0x3C 0x64 0x74 0x66 0x68 0x78 0x68 0x68 0x7A 0x6A 0x68 0x78 0x78 0x7D 0x6D 0x0C 0x80 0x40 0x20 0x10 0x11 0x08 0x04 0x02 0x03 0x08 0x04 0x0F"/>
          <property name="HvspEnterProgMode_stabDelay" value="100"/>
          <property name="HvspEnterProgMode_cmdexeDelay" value="50"/>
          <property name="HvspEnterProgMode_synchCycles" value="6"/>
          <property name="HvspEnterProgMode_latchCycles" value="1"/>
          <property name="HvspEnterProgMode_toggleVtg" value="1"/>
          <property name="HvspEnterProgMode_powoffDelay" value="50"/>
          <property name="HvspEnterProgMode_resetDelay1" value="0"/>
          <property name="HvspEnterProgMode_resetDelay2" value="3"/>
          <property name="HvspLeaveProgMode_stabDelay" value="100"/>
          <property name="HvspLeaveProgMode_resetDelay" value="25"/>
          <property name="HvspChipErase_pollTimeout" value="40"/>
          <property name="HvspChipErase_eraseTime" value="0"/>
          <property name="HvspProgramFlash_mode" value="0x0B"/>
          <property name="HvspProgramFlash_blockSize" value="64"/>
          <property name="HvspProgramFlash_pollTimeout" value="5"/>
          <property name="HvspReadFlash_blockSize" value="64"/>
          <property name="HvspProgramEeprom_mode" value="0x05"/>
          <property name="HvspProgramEeprom_blockSize" value="4"/>
          <property name="HvspProgramEeprom_pollTimeout" value="5"/>
          <property name="HvspReadEeprom_blockSize" value="4"/>
          <property name="HvspProgramFuse_pollTimeout" value="25"/>
          <property name="HvspProgramLock_pollTimeout" value="25"/>
        </property-group>
        <property-group name="ISP_INTERFACE_STK600">
          <property name="IspEnterProgMode_timeout" value="200"/>
          <property name="IspEnterProgMode_stabDelay" value="100"/>
          <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
          <property name="IspEnterProgMode_synchLoops" value="32"/>
          <property name="IspEnterProgMode_byteDelay" value="0"/>
          <property name="IspEnterProgMode_pollIndex" value="3"/>
          <property name="IspEnterProgMode_pollValue" value="0x53"/>
          <property name="IspLeaveProgMode_preDelay" value="1"/>
          <property name="IspLeaveProgMode_postDelay" value="1"/>
          <property name="IspChipErase_eraseDelay" value="45"/>
          <property name="IspChipErase_pollMethod" value="1"/>
          <property name="IspProgramFlash_mode" value="0x41"/>
          <property name="IspProgramFlash_blockSize" value="64"/>
          <property name="IspProgramFlash_delay" value="6"/>
          <property name="IspProgramFlash_cmd1" value="0x40"/>
          <property name="IspProgramFlash_cmd2" value="0x4C"/>
          <property name="IspProgramFlash_cmd3" value="0x00"/>
          <property name="IspProgramFlash_pollVal1" value="0x00"/>
          <property name="IspProgramFlash_pollVal2" value="0x00"/>
          <property name="IspProgramEeprom_mode" value="0x41"/>
          <property name="IspProgramEeprom_blockSize" value="4"/>
          <property name="IspProgramEeprom_delay" value="5"/>
          <property name="IspProgramEeprom_cmd1" value="0xC1"/>
          <property name="IspProgramEeprom_cmd2" value="0xC2"/>
          <property name="IspProgramEeprom_cmd3" value="0x00"/>
          <property name="IspProgramEeprom_pollVal1" value="0x00"/>
          <property name="IspProgramEeprom_pollVal2" value="0x00"/>
          <property name="IspReadFlash_blockSize" value="64"/>
          <property name="IspReadEeprom_blockSize" value="4"/>
          <property name="IspReadFuse_pollIndex" value="4"/>
          <property name="IspReadLock_pollIndex" value="4"/>
          <property name="IspReadSign_pollIndex" value="4"/>
          <property name="IspReadOsccal_pollIndex" value="4"/>
        </property-group>
        <property-group name="HVSP_INTERFACE_STK600">
          <property name="HvspControlStack" value="0x4C 0x0C 0x1C 0x2C 0x3C 0x64 0x74 0x66 0x68 0x78 0x68 0x68 0x7A 0x6A 0x68 0x78 0x78 0x7D 0x6D 0x0C 0x80 0x40 0x20 0x10 0x11 0x08 0x04 0x02 0x03 0x08 0x04 0x0F"/>
          <property name="HvspEnterProgMode_stabDelay" value="100"/>
          <property name="HvspEnterProgMode_cmdexeDelay" value="50"/>
          <property name="HvspEnterProgMode_synchCycles" value="6"/>
          <property name="HvspEnterProgMode_latchCycles" value="1"/>
          <property name="HvspEnterProgMode_toggleVtg" value="1"/>
          <property name="HvspEnterProgMode_powoffDelay" value="150"/>
          <property name="HvspEnterProgMode_resetDelay1" value="0"/>
          <property name="HvspEnterProgMode_resetDelay2" value="3"/>
          <property name="HvspLeaveProgMode_stabDelay" value="100"/>
          <property name="HvspLeaveProgMode_resetDelay" value="25"/>
          <property name="HvspChipErase_pollTimeout" value="40"/>
          <property name="HvspChipErase_eraseTime" value="0"/>
          <property name="HvspProgramFlash_mode" value="0x09"/>
          <property name="HvspProgramFlash_blockSize" value="64"/>
          <property name="HvspProgramFlash_pollTimeout" value="5"/>
          <property name="HvspReadFlash_blockSize" value="64"/>
          <property name="HvspProgramEeprom_mode" value="0x05"/>
          <property name="HvspProgramEeprom_blockSize" value="4"/>
          <property name="HvspProgramEeprom_pollTimeout" value="5"/>
          <property name="HvspReadEeprom_blockSize" value="4"/>
          <property name="HvspProgramFuse_pollTimeout" value="25"/>
          <property name="HvspProgramLock_pollTimeout" value="25"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module caption="Fuses" name="FUSE">
      <register-group caption="Fuses" name="FUSE">
        <register caption="" name="EXTENDED" offset="0x02" size="1" initval="0xFF">
          <bitfield caption="Brown-out Detector trigger level" mask="0x07" name="BODLEVEL" values="ENUM_BODLEVEL"/>
        </register>
