avr-rust/avrd/packs/tiny/ATtiny840.atdf
    <module caption="Analog Comparator" name="AC">
      <register-group caption="Analog Comparator" name="AC">
        <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x50" size="1" ocd-rw="R">
          <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
          <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
          <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
          <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
          <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
          <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
          <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS" values="ANALOG_COMP_INTERRUPT"/>
        </register>
        <register caption="Digital Input Disable Register 1" name="DIDR" offset="0x7F" size="1">
          <bitfield caption="AINP0 Digital Input Disable" mask="0x01" name="AINP0D"/>
          <bitfield caption="AINP1 Digital Input Disable" mask="0x02" name="AINP1D"/>
          <bitfield caption="AINN0 Digital Input Disable" mask="0x04" name="AINN0D"/>
          <bitfield caption="AINN1 Digital Input Disable" mask="0x08" name="AINN1D"/>
          <bitfield caption="AINN2 Digital Input Disable" mask="0x10" name="AINN2D"/>
        </register>
        <register caption="Analog Comparator Mux register" name="ACMUX" offset="0x2F" size="1">
          <bitfield caption="Analog Comparator Negative input select" mask="0x03" name="MUXNEG"/>
          <bitfield caption="Analog Comparator Positive input select" mask="0x04" name="MUXPOS"/>
          <bitfield caption="Analog Comparator Output Enable" mask="0x08" name="ACOE"/>
          <bitfield caption="Custom Logic Interrupt Select" mask="0x30" name="CLIS" values="CUSTOM_LOGIC_INTERRUPT"/>
          <bitfield caption="Custom Logic Interrupt Enable" mask="0x40" name="CLIE"/>
        </register>
        <register caption="Custom Logic Control Register" name="CLCR" offset="0x38" size="1">
          <bitfield caption="Custom Logic Set" mask="0x80" name="CLSET"/>
          <bitfield caption="Custom Logic Clear" mask="0x40" name="CLCLR"/>
          <bitfield caption="Custom Logic Trigger Timer/Counter 3" mask="0x20" name="TC3TRIGEN"/>
          <bitfield caption="Custom Logic Output Enable" mask="0x18" name="CLOEN"/>
          <bitfield caption="Custom Logic Demux Select" mask="0x04" name="SEL"/>
          <bitfield caption="Custom Logic Inverter Enable" mask="0x02" name="INVEN"/>
          <bitfield caption="Custom Logic Enable" mask="0x01" name="CLEN"/>
        </register>
        <register caption="Custom Logic Status Register" name="CLSR" offset="0x39" size="1">
          <bitfield caption="Custom Logic Interrupt Flag" mask="0x02" name="CLIF"/>
          <bitfield caption="Custom Logic Latch State" mask="0x01" name="STATE"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_COMP_INTERRUPT">
        <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
        <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="CUSTOM_LOGIC_INTERRUPT">
        <value caption="Interrupt on Toggle" name="VAL_0x01" value="0x01"/>
        <value caption="Reserved" name="VAL_0x00" value="0x00"/>
        <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
        <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="I/O Port" name="PORT">
      <register-group caption="I/O Port" name="PORTB">
        <register caption="Port B Data Register" name="PORTB" offset="0x25" size="1" mask="0xFF"/>
        <register caption="Port B Data Direction Register" name="DDRB" offset="0x24" size="1" mask="0xFF"/>
        <register caption="Port B Input Pins" name="PINB" offset="0x23" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTC">
        <register caption="Port C Data Register" name="PORTC" offset="0x28" size="1" mask="0x7F"/>
        <register caption="Port C Data Direction Register" name="DDRC" offset="0x27" size="1" mask="0x7F"/>
        <register caption="Port C Input Pins" name="PINC" offset="0x26" size="1" mask="0x7F" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTD">
        <register caption="Port D Data Register" name="PORTD" offset="0x2B" size="1" mask="0xFF"/>
        <register caption="Port D Data Direction Register" name="DDRD" offset="0x2A" size="1" mask="0xFF"/>
        <register caption="Port D Input Pins" name="PIND" offset="0x29" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
    </module>
    <module caption="Timer/Counter, 8-bit" name="TC8">
      <register-group caption="Timer/Counter, 8-bit" name="TC0">
        <register caption="Timer/Counter0 Output Compare Register" name="OCR0B" offset="0x48" size="1" mask="0xFF"/>
        <register caption="Timer/Counter0 Output Compare Register" name="OCR0A" offset="0x47" size="1" mask="0xFF"/>
        <register caption="Timer/Counter0" name="TCNT0" offset="0x46" size="1" mask="0xFF"/>
        <register caption="Timer/Counter Control Register B" name="TCCR0B" offset="0x45" size="1">
          <bitfield caption="Force Output Compare A" mask="0x80" name="FOC0A"/>
          <bitfield caption="Force Output Compare B" mask="0x40" name="FOC0B"/>
          <bitfield caption="" mask="0x08" name="WGM02"/>
          <bitfield caption="Clock Select" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter  Control Register A" name="TCCR0A" offset="0x44" size="1">
          <bitfield caption="Compare Output Mode, Phase Correct PWM Mode" mask="0xC0" name="COM0A"/>
          <bitfield caption="Compare Output Mode, Fast PWm" mask="0x30" name="COM0B"/>
          <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM0"/>
        </register>
